#include <iostream>

/*
 * 原题见: https://adworld.xctf.org.cn/task/answer?type=reverse&number=4&grade=1&id=4750&page=1
 * 原题为同目录下的 rev300, IDA 输出文件见 rev300.idb
 *
 * 为啥是 .idb 我也不清楚,但是我保存数据库(压缩)就变成这个了,不过分析难度不大
 */

int main()
{
    int/*unsigned char*/ mask[33] =
    {
		15,// 0, 0, 0,
		31,// 0, 0, 0,
		4, // 0, 0, 0,
		9, // 0, 0, 0,
		28,// 0, 0, 0,
		18,// 0, 0, 0,
		66,// 0, 0, 0,
		9, // 0, 0, 0,
		12,// 0, 0, 0,
		68,// 0, 0, 0,
		13,// 0, 0, 0,
		7, // 0, 0, 0,
		9, // 0, 0, 0,
		6, // 0, 0, 0,
		45,// 0, 0, 0,
		55,// 0, 0, 0,
		89,// 0, 0, 0,
		30,// 0, 0, 0,
		0, // 0, 0, 0,
		89,// 0, 0, 0,
		15,// 0, 0, 0,
		8, // 0, 0, 0,
		28,// 0, 0, 0,
		35,// 0, 0, 0,
		54,// 0, 0, 0,
		7, // 0, 0, 0,
		85,// 0, 0, 0,
		2, // 0, 0, 0,
		12,// 0, 0, 0,
		8, // 0, 0, 0,
		65,// 0, 0, 0,
		10,// 0, 0, 0,
		20,// 0, 0, 0
    };

	char str[] = "isengard";
	
	for(int i = 0; i <= 32; ++i)
	{
		std::cout << char(mask[i] ^ str[i % 8]);
	}
}
